Repository: 84000/data-translation-memory
Catalog: toh56-v4.tmx
Source language: bo
Languages: en

source: ཤཱ་རིའི་བུ་བྱང་ཆུབ་ནི་དག་པ། དྲི་མ་མེད་པ། ཉོན་མོངས་པ་མེད་པའོ། ། དེ་ལ་དག་པ་གང་། དྲི་མ་མེད་པ་གང་། ཉོན་མོངས་པ་མེད་པ་གང་ཞེ་ན། སྟོང་པ་ཉིད་ནི་དག་པའོ། ། མཚན་མ་མེད་པ་ནི་དྲི་མ་མེད་པའོ། ། སྨོན་པ་མེད་པ་ནི་ཉོན་མོངས་པ་མེད་པའོ། ། སྐྱེ་བ་མེད་པ་ནི་དག་པའོ། ། མངོན་པར་འདུ་མི་བྱེད་པ་ནི་དྲི་མ་མེད་པའོ། ། ཉེ་བར་ལེན་པ་མེད་པ་ནི་ཉོན་མོངས་པ་མེད་པའོ། ། རང་བཞིན་ནི་དག་པའོ། ། ཡོངས་སུ་དག་པ་ནི་དྲི་མ་མེད་པའོ། ། འོད་གསལ་བ་ནི་ཉོན་མོངས་པ་མེད་པའོ། ། སྤྲོས་པ་མེད་པ་ནི་དག་པའོ། ། མ་སྤྲོས་པ་ནི་དྲི་མ་མེད་པའོ། ། སྤྲོས་པ་ཉེ་བར་ཞི་བ་ནི་ཉོན་མོངས་པ་མེད་པའོ། ། དེ་བཞིན་ཉིད་ནི་དག་པའོ། ། ཆོས་ཀྱི་དབྱིངས་ནི་དྲི་མ་མེད་པའོ། ། ཡང་དག་པའི་མཐའ་ནི་ཉོན་མོངས་པ་མེད་པའོ། ། གོ་འབྱེད་པ་ནི་དག་པའོ། ། ནམ་མཁའ་ནི་དྲི་མ་མེད་པའོ། ། ནམ་མཁའ་ནི་ཉོན་མོངས་པ་མེད་པའོ། ། ནང་ཡོངས་སུ་ཤེས་པ་ནི་དག་པའོ། ། ཕྱི་རོལ་དུ་མི་རྒྱུག་པ་ནི་དྲི་མ་མེད་པའོ། ། ཕྱི་དང་ནང་མི་དམིགས་པ་ནི་ཉོན་མོངས་པ་མེད་པའོ། ། ཕུང་པོ་ཡོངས་སུ་ཤེས་པ་ནི་དག་པའོ། ། ཁམས་ཀྱི་རང་བཞིན་ནི་དྲི་མ་མེད་པའོ། ། སྐྱེ་མཆེད་སྤོང་བ་ནི་ཉོན་མོངས་པ་མེད་པའོ། ། འདས་པ་ལ་ཟད་པ་ཤེས་པ་ནི་དག་པའོ། ། མ་འོངས་པ་ལ་མི་སྐྱེ་བ་ཤེས་པ་ནི་དྲི་མ་མེད་པའོ། ། ད་ལྟར་བྱུང་བ་ལ་ཆོས་ཀྱི་དབྱིངས་ལ་གནས་པའི་ཡེ་ཤེས་ནི་ཉོན་མོངས་པ་མེད་པ་སྟེ། དེ་ལྟར་དག་པ་དང་དྲི་མ་མེད་པ་དང་། ཉོན་མོངས་པ་མེད་པ་གནས་གཅིག་ཏུ་འཇུག་པར་འགྱུར་བ་ནི་འདི་ལྟ་སྟེ། ཞི་བའི་གནས་སོ། ། གང་ཞི་བ་དེ་ནི་རབ་ཏུ་ཞི་བ། དེ་ནི་ཉེ་བར་ཞི་བ་སྟེ། ཐུབ་པ་ཞེས་བྱའོ། །
en: “Śāriputra, awakening is pure, stainless, and free of blemishes. In what way is it pure, stainless, and free of blemishes? As it is emptiness, it is pure. As it lacks attributes, it is stainless. As it is without aspiration, it is free of blemishes. As it is without birth, it is pure. As it lacks conceptual formation, it is stainless. As it is without clinging, it is free of blemishes. As it is natural, it is pure. As it is completely purified, it is stainless. As it is luminous, it is free of blemishes. As it is without elaboration, it is pure. As it does not elaborate, it is stainless. As its elaborations have subsided, it is free of blemishes. As it is just as it is, it is pure. As it is the totality of phenomena, it is stainless. As it is the summit of existence, it is free of blemishes. As it is space, it is pure. As it is the sky, it is stainless. As it is the firmament, it is free of blemishes. As it is understanding of the internal, it is pure. As it is unmoved by the external, it is stainless. As it does not conceive of the internal and the external, it is free of blemishes. As it is understanding of the skandhas, it is pure. As it is the nature of the elements, it is stainless. As it rejects the sense fields, it is free of blemishes. As it knows that cessation is in the past, it is pure. As it knows that the unarisen is in the future, it is stainless. As it has knowledge based in the totality of phenomena in the present, it is free of blemishes. Thus, purity, stainlessness, and freedom from blemishes relate to a single state, the state of tranquility. Tranquility is being calmed. To be calmed is to be at peace. One is then said to be a sage.

source: དེ་ལྟ་བས་ན་ནམ་མཁའ་ཇི་ལྟ་བར་བྱང་ཆུབ་ཀྱང་དེ་བཞིན་ནོ། ། བྱང་ཆུབ་ཇི་ལྟ་བར་ཆོས་ཀྱང་དེ་བཞིན་ནོ། ། ཆོས་ཇི་ལྟ་བར་སེམས་ཅན་ཡང་དེ་བཞིན་ནོ། ། སེམས་ཅན་ཇི་ལྟ་བར་ཞིང་ཡང་དེ་བཞིན་ནོ། ། ཞིང་ཇི་ལྟ་བར་མྱ་ངན་ལས་འདས་པ་ཡང་དེ་བཞིན་ནོ། ། དེ་བས་ན་ཆོས་ཐམས་ཅད་ནི་མྱ་ངན་ལས་འདས་པ་དང་། མཉམ་པ་ཞེས་བྱ་སྟེ། མཐར་ཐུག་པའི་རྣམ་པས་གཉེན་པོ་མེད་དོ། ། གཉེན་པོ་མེད་པའི་རྣམ་པས་ཐོག་མ་ནས་རྣམ་པར་དག་པའོ། ། ཐོག་མ་ནས་དྲི་མ་མེད་པའོ། ། ཐོག་མ་ནས་ཉོན་མོངས་པ་མེད་པའོ། ། དེ་ལ་དེ་བཞིན་གཤེགས་པས་འདི་ལྟར་གཟུགས་ཅན་དང་། གཟུགས་མེད་པའི་ཆོས་ཐམས་ཅད་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་སེམས་ཅན་གྱི་ཁམས་ལ་རྣམ་པར་གཟིགས་ཤིང་སེམས་ཅན་རྣམས་ལ་དག་པ་དང་། དྲི་མ་མེད་པ། ཉོན་མོངས་པ་མེད་པས་རྣམ་པར་རོལ་པ་ཞེས་བྱ་བའི་སྙིང་རྗེ་ཆེན་པོ་འཇུག་གོ།
en: “Thus, space is just like awakening. Awakening is just like phenomena. Phenomena are just like sentient beings. Sentient beings are just like a field. A field is just like nirvāṇa. So it is said that all phenomena are the same as nirvāṇa. As it is the final state, it has no adversary. As it has no adversary, it is primordially pure, primordially stainless, and primordially free of blemishes. The Tathāgata has fully understood all phenomena of form and of no form in this way and has beheld the world of sentient beings. He thus engages with sentient beings with the great compassion that is known as the play of purity, stainlessness, and freedom from blemishes.

source: དེ་ལྟར་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པའི་སྙིང་རྗེ་ཆེན་པོ་དག་པ་དང་། དྲི་མ་མེད་པ་དང་། ཉོན་མོངས་པ་མེད་པར་ལྷུན་གྱིས་གྲུབ་པས་རྟག་ཏུ་འཇུག་སྟེ། ཕྱིས་གཏང་བར་བྱ་བ་མེད་ཅིང་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་རབ་འབྱམ་མ་ལུས་པར་ཐོགས་པ་མེད་དོ། ། དེ་ལྟར་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པའི་སྙིང་རྗེ་ཆེན་པོ་ནི་མཐའ་ཡས་མུ་མེད་དེ། གང་དེ་བཞིན་གཤེགས་པའི་སྙིང་རྗེ་ཆེན་པོའི་མཐའ་འདོད་པ་དེ་ནི་ནམ་མཁའི་མཐའ་འདོད་དོ། ། བྱང་ཆུབ་སེམས་དཔས་དེ་བཞིན་གཤེགས་པའི་སྙིང་རྗེ་ཆེན་པོ་བསམ་གྱིས་མི་ཁྱབ་པ་དེ་ཐོས་ནས། མངོན་པར་དད། ཡིད་ཆེས། རབ་ཏུ་རྟོག ། སོམ་ཉི་མེད། ཐེ་ཚོམ་མི་ཟ་བ་ནས་ནམ་མཁའ་ལྟ་བུར་བསམ་གྱིས་མི་ཁྱབ་པའི་ཕྱིར་ངོ་མཚར་དང་། རྨད་ཀྱི་བར་དུ་འདུ་ཤེས་སྐྱེད་དོ། །
en: “Thus, Śāriputra, the great compassion of the Tathāgata, which is pure, stainless, and free of blemishes, is always effortlessly engaged. It will never falter, and it is completely unobstructed in the vast realms of the ten directions of the world. Śāriputra, the great compassion of the Tathāgata is boundless. If one could claim that there is a limit to space, then one could also claim that there is a limit to the Tathāgata’s great compassion. When the bodhisatva learns of the inconceivable great compassion of the Tathāgata, he develops great faith, trust, and confidence, he has no uncertainty or doubt, and so forth, and as his great compassion is as inconceivable as space, he considers it to be truly wondrous and extraordinary.”

source: རྩ་བ་མེད་ཅིང་གནས་མེད་པ། །སངས་རྒྱས་ཀྱིས་ནི་བྱང་ཆུབ་རེག །
en: “Rootless and without support Is the awakening the Buddha has attained,

source: ཇི་ལྟར་རྟོགས་པ་དེ་བཞིན་དུ། །སྲོག་ཆགས་རྣམས་ནི་ཀུན་ལ་སྟོན། །
en: And he instructs all beings In accordance with his understanding.

source: ནང་གི་མིག་ནི་སྟོང་པ་སྟེ། །
en: “Internally, the eye is empty.

source: ཕྱི་རོལ་གཟུགས་ཀྱང་སྟོང་པའོ། །
en: Externally, forms are empty.

source: ཞི་དང་ཉེ་བར་ཞི་བ་ཡི། །སངས་རྒྱས་ཀྱིས་ནི་བྱང་ཆུབ་རེག །ཞི་དང་ཉེ་བར་ཞི་བ་དེ། །
en: Tranquility and peace Is the awakening the Buddha has attained. “Sentient beings do not recognize This tranquility and peace,

source: སེམས་ཅན་ཁོང་དུ་མ་ཆུད་པས། །ཚིག་དོན་རྟོགས་ནས་སེམས་ཅན་ལ། །དེ་དག་ལ་ནི་སྙིང་རྗེ་འཇུག །
en: So having understood words and meanings, He meets sentient beings with compassion.

source: བྱང་ཆུབ་རང་བཞིན་འོད་གསལ་ཞིང་། །རྣམ་དག་ནམ་མཁའ་འདྲ་བ་དེ། །
en: “Awakening is natural and radiant. It is completely pure like the heavens.

source: སེམས་ཅན་རྣམས་ཀྱིས་མི་ཤེས་པས། །དེ་དག་ལ་ཡང་སྙིང་རྗེ་འཇུག །
en: As sentient beings do not know this, He has compassion for them.

source: ཆོས་རྣམས་ཀུན་ལ་འཛིན་པ་དང་། །རབ་ཏུ་འཛིན་པ་ཡོད་མ་ཡིན། ། བླང་མེད་དོར་བ་མེད་པ་ཡི། །སངས་རྒྱས་ཀྱིས་ནི་བྱང་ཆུབ་རེག །
en: “Phenomena are not grasped Or apprehended. The Dharma the Buddha has realized Is without abandonment, without exertion.

source: སེམས་ཅན་འདི་དག་མི་ཤེས་པས། །དེ་དག་ལ་ནི་སྙིང་རྗེ་འཇུག །
en: Sentient beings do not recognize this, And so he has compassion for them.

source: མཚན་མ་མེད་ཅིང་དམིགས་པ་མེད། ། འཕགས་པ་རྣམས་ཀྱི་སྤྱོད་ཡུལ་འདི། །བྱིས་པའི་སྤྱོད་ཡུལ་མ་ཡིན་པ། །སངས་རྒྱས་ཀྱིས་ནི་བྱང་ཆུབ་རེག །
en: “There are no attributes and no objects From the perspective of the noble ones. The awakening the Buddha has attained Is not something that can be accessed by the immature.

source: གང་དག་མི་མཁས་བཅིངས་པ་ཡི། །སོ་སོའི་སྐྱེ་བོས་མི་ཤེས་པས། །དེ་བཞིན་གཤེགས་པ་སེམས་ཅན་ལ། །སྙིང་རྗེ་ཆེན་པོ་རབ་ཏུ་འཇུག །
en: “Ordinary beings have no knowledge of it; Lacking wisdom, they are bound. The Tathāgata acts with great compassion Toward sentient beings.

source: རང་བཞིན་གྱིས་ནི་འདུས་མ་བྱས། །སྐྱེ་བ་མེད་ཅིང་འཇིག་པ་མེད། །
en: “Being by nature unconditioned, It has no birth and no cessation.

source: དེ་ལ་གནས་པ་ཡོད་མིན་ཏེ། །
en: It cannot be located,

source: མཚན་ཉིད་གསུམ་ལས་རྣམ་པར་གྲོལ། །
en: And it is free of the three characteristics.

source: འདུས་བྱས་རྣམས་ཀྱི་རང་བཞིན་ནི། །བྱིས་པས་ཁོང་དུ་མི་ཆུད་པས།
en: “The immature do not realize That this is the nature of conditioned things.

source: །དེ་དག་ལ་ཡང་སྙིང་རྗེ་འཇུག །ཚུལ་འདི་གང་གིས་སངས་རྒྱས་པ། །བྱང་ཆུབ་ལུས་ཀྱིས་མི་རྟོགས་ཏེ། །སེམས་ཀྱིས་ཀྱང་ནི་འཚང་མི་རྒྱ། །
en: With compassion he engages with them, So that they may awaken to this principle. “The body does not attain awakening, Nor is it the mind that is awakened.

source: ལུས་ནི་བེམས་པོའི་རང་བཞིན་ཏེ། །
en: The body is by nature lifeless,

source: སེམས་ཀྱང་སྒྱུ་མ་ལྟ་བུའོ། །
en: And the mind is just like an illusion.

source: ལུས་དང་སེམས་ཀྱི་རང་བཞིན་ཏེ། ། བྱིས་པས་ཁོང་དུ་མ་ཆུད་པས། །
en: “The immature do not realize That this is the nature of the body and mind.

source: ཚུལ་འདི་ཁོང་དུ་ཆུད་གྱུར་ནས། །དེ་དག་ལ་ནི་སྙིང་རྗེ་འཇུག །
en: With compassion, therefore, he engages with them, So that they may awaken to this principle.

source: རང་བྱུང་བ་ནི་བྱང་ཆུབ་དམ་པ་རྒྱ་ཆེན་མཆོག་རེག་སྟེ། །
en: “He reaches the great supreme summit, spontaneous awakening,

source: ཤིང་མཆོག་དྲུང་དུ་བཞུགས་ནས་སེམས་ཅན་ཁམས་ལ་རྣམ་པར་གཟིགས། །
en: And seated at the tree of excellence, he beholds the world of sentient beings.

source: འཁོར་བའི་འཁོར་ལོར་ཞུགས་ཤིང་འགྲོ་རྒྱུད་སྣ་ཚོགས་འཁྱམ་གྱུར་པ། །དེ་དག་གཟིགས་ནས་སངས་རྒྱས་ཀྱི་ནི་སྙིང་རྗེ་མི་ཟད་འཇུག །
en: Thrown around in the wheel of existence, in the various states they wander. Having seen this, the Buddha is stirred by intense compassion.

source: ང་དང་རྒྱགས་པ་དག་ལ་ཆགས་ཤིང་ལྟ་བའི་དྲ་བས་གཟིངས། །
en: “They are driven by pride and conceit, bound by the web of views.

source: སྡུག་བསྔལ་བ་དེ་དང་མི་རྟག་རྟག་དང་སྡུག་པར་འདུ་ཤེས་ཤིང་། །བདག་དང་སེམས་ཅན་དང་ནི་སྲོག་ཏུ་ལྟ་བར་ཆགས་པ་རྣམས།
en: They see happiness in suffering, permanence in impermanence, and are drawn toward beauty. They hold the views of a self, of a being, of a life force.

source: །གཟིགས་ནས་དེ་དག་ལ་ནི་སངས་རྒྱས་སྙིང་རྗེ་མི་ཟད་འཇུག །
en: When he sees this, the Buddha reaches out to them with intense compassion.

source: སེམས་ཅན་ཁམས་ནི་གཏི་མུག་ལིང་ཏོག་ཁེབས་ཤིང་བསྒྲིབས་པ་ཀུན། །ཉི་མ་སྤྲིན་ཁེབས་བཞིན་དུ་སྣང་མེད་ལམ་མེར་མི་འགྱུར་བ། །
en: “The world of sentient beings is afflicted and hindered by the cataracts of confusion, Just as the sun does not appear and shine when obscured by a cover of clouds.

source: དེ་དག་གཟིགས་ནས་ཡེ་ཤེས་སྣང་བ་དྲི་མེད་འོད་བྱ་ཞེས། །དེ་དག་ལ་ཡང་སངས་རྒྱས་ཀྱི་ནི་སྙིང་རྗེ་མི་ཟད་འཇུག །
en: When he sees this, the Buddha is filled with intense compassion and pledges, ‘I will fill this world with the stainless light of wisdom.’

source: ངན་ཚོགས་འགྲོ་བར་ཞུགས་ཤིང་ལམ་སྟོང་རབ་ཏུ་འཁྱམས་པ་རྣམས། །སེམས་ཅན་སེམས་ཅན་དམྱལ་དང་དུད་འགྲོ་ཡི་དགས་རྒྱུད་ལྷུང་བ། །
en: “They have fallen into the lower realms. They have lost their path and gone astray. Sentient beings have descended to the hellish realms; they have become animals and pretas.

source: དེ་དག་གཟིགས་ནས་སྔོན་གྱི་རྒྱལ་བས་བསྙེན་པའི་ལམ་བསྟན་ཅེས། །དེ་དག་ལ་ཡང་སངས་རྒྱས་ཀྱི་ནི་སྙིང་རྗེ་མི་ཟད་འཇུག །དེ་བཞིན་ཉིད་ལྟར་དེ་བཞིན་ཉིད་དུ་ཆོས་རྣམས་ཐམས་ཅད་ནི། །ནམ་མཁའ་མཚུངས་འདྲ་དེ་དག་མ་བཅིངས་མ་གྲོལ་རབ་མཁྱེན་ཏེ། །འགྲོ་བ་དག་ཅིང་བཟང་བའི་ཆོས་རྣམས་མི་ཤེས་གཟིགས་ནས་སུ། །དེ་དག་ལ་ཡང་སངས་རྒྱས་ཀྱི་ནི་སྙིང་རྗེ་མི་ཟད་འཇུག །
en: When he sees this, the Buddha says, ‘I will show them the path Followed by the victorious ones of the past,’ and reaches out with intense compassion. “He understands that phenomena are in accord with the principle of suchness, Sky-like, unbound, and with no need for release. He sees the beings who do not know this pure state of phenomena, And so reaches out to them with unending compassion.

source: དེ་ལྟར་ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་དེ་བཞིན་གཤེགས་པའི་སྙིང་རྗེ་ཆེན་པོ་བསམ་གྱིས་མི་ཁྱབ་པ་ལ་མངོན་པར་དད། ཡིད་ཆེས། རབ་ཏུ་རྟོག ། སོམ་ཉི་མེད། ཐེ་ཚོམ་མི་ཟ། རྒྱ་ཆེར་དགའ་མགུ་སྟེ་རངས་པ་རྙེད་ནས་ནམ་མཁའ་ལྟ་བུར་བསམ་གྱིས་མི་ཁྱབ་པའི་ཕྱིར་ངོ་མཚར་དང་རྨད་དུ་འདུ་ཤེས་སྐྱེད་དོ།། །།
en: “This, Śāriputra, is the inconceivable great compassion of the Tathāgata, in which the bodhisatva has great faith, trust, and confidence, without uncertainty and doubt. The Tathāgata brings him pleasure, joy, and satisfaction, and as his great compassion is as inconceivable as space, he considers it to be truly wondrous and extraordinary.

source: ཡང་ཤཱ་རིའི་བུ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་བཞིན་གཤེགས་པའི་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་ལ་མངོན་པར་དད། ཡིད་ཆེས། རབ་ཏུ་རྟོག་པ་ནས། ངོ་མཚར་དང་། རྨད་ཀྱི་བར་དུ་འདུ་ཤེས་སྐྱེད་ཅེ་ན། ། ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པའི་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་ནི་བཅྭ་བརྒྱད་པོ་འདི་དག་སྟེ། ཆོས་དེ་དག་དང་ལྡན་པས་དེ་བཞིན་གཤེགས་པ་འཁོར་གྱི་ནང་དུ་སེང་གེའི་སྒྲ་ཡང་དག་པར་སྒྲོག་ཅིང་ཁྱུ་མཆོག་གི་གནས་སུ་ཞལ་གྱིས་འཆེ་སྟེ། དགེ་སྦྱོང་ངམ། བྲམ་ཟེ་འམ། ལྷ་འམ། བདུད་དམ། སུས་ཀྱང་འཇིག་རྟེན་དུ་ཆོས་དང་འཐུན་པར་མ་བསྐོར་བ་ཚངས་པའི་འཁོར་ལོ་རབ་ཏུ་བསྐོར་ཏོ། །
en: “Śāriputra, what are the Tathāgata’s inconceivable unique buddha qualities, given which the bodhisatva has great faith, trust, and confidence, and so forth and considers them to be truly wondrous and extraordinary? Śāriputra, the Tathāgata has eighteen unique buddha qualities, and equipped with these qualities the Tathāgata roars a true lion’s roar in the assembly, asserts the state of the supreme bull, and turns the holy wheel that no ascetic, brahmin, god, or māra of this world has legitimately turned.

source: སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་གང་ཞེ་ན། འདི་ལ་ཤཱ་རིའི་བུ་གང་གི་ཕྱིར་ལུས་ཀྱི་འཁྲུལ་པ་གང་ལས་བྱིས་པའམ། མཁས་པ་ཆོས་དང་འཐུན་པས་རྒོལ་བར་བྱེད་པའི་ལུས་ཀྱི་འཁྲུལ་པ་དེ་བཞིན་གཤེགས་པ་ལ་མེད་དོ། ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་ལུས་ཀྱི་ལས་འཁྲུལ་པ་མེད་པ་སྟེ། དེ་བཞིན་གཤེགས་པའི་སྤྱོད་ལམ་མ་མཛེས་པས་ཀུན་དུ་གཟིགས་པ་དང་། རྣམ་པར་གཟིགས་པ་དང་། བསྐུམ་པ་དང་། སྙང་བ་དང་། ཆོས་གོས་སྣམ་སྦྱར་དང་། ཆོས་གོས་དང་། ལྷུང་བཟེད་བསྣམས་པ་དང་། མངོན་དུ་གཤེགས་པ་དང་། སླར་གཤེགས་པ་དང་། བྱོན་པ་དང་། བཞུད་པ་དང་། བཞེངས་པ་དང་། བཞུགས་པ་དང་། མནལ་བ་དང་། གྲོང་དང་གྲོང་ཁྱེར་དུ་འཇུག་པ་དང་འབྱུང་བ་ན་ཞབས་ཀྱི་མཐིལ་ས་ལ་མི་རེག་སྟེ འཁོར་ལོ་རྩིབས་སྟོང་པས་ལས་འབྱུང་ཞིང་དྲི་ཡིད་དུ་འོང་བའི་པད་མ་མངོན་པར་འབྱུང་སྟེ། དེ་ལ་དེ་བཞིན་གཤེགས་པའི་ཞབས་འཇོག་གོ ། དེ་ལ་གང་དུད་འགྲོའི་སྐྱེ་གནས་སུ་སོང་བའི་སེམས་ཅན་དག་གིས་དེ་བཞིན་གཤེགས་པའི་ཞབས་ལ་རེག་ན་དེ་དག་ཞག་བདུན་དུ་རབ་ཏུ་བདེ་བ་དང་ལྡན་པར་འགྱུར། ཤི་འཕོས་ནས་ཀྱང་བདེ་འགྲོའི་མཐོ་རིས་ཀྱི་འཇིག་རྟེན་དུ་སྐྱེ་བར་འགྱུར་རོ། ། དེ་བཞིན་གཤེགས་པའི་སྐུ་ལ་ཆོས་གོས་སོར་བཞི་ཙམ་གྱིས་མི་རེག་མོད་ཀྱི། རྣམ་པར་འཐོར་རླུང་གིས་ཀྱང་བཟློག་པར་མི་ནུས་སོ། ། སྐུའི་འོད་ཀྱིས་མནར་མེད་པའི་བར་གྱི་སེམས་ཅན་བདེ་བའི་ཚོར་བ་མྱོང་བར་འགྱུར་ཏེ། དེའི་ཕྱིར་དེ་བཞིན་གཤེགས་པའི་སྐུ་ལ་འཁྲུལ་པ་མེད་ཅེས་བྱའོ། །
en: “What are these eighteen unique buddha qualities? Śāriputra, the Buddha does not err, and neither the immature nor the learned can legitimately accuse him of any bodily violation. Why is this? It is because the lords, the buddhas, are unerring in their bodily conduct. The Tathāgata conducts himself with grace. Looking ahead and all around, with graceful limbs, carrying his robes and bowl, he goes from place to place. He leaves and returns, walks, stands, sits, and lies down, and enters and leaves villages and towns, without the soles of his feet touching the ground. Wherever he steps, thousand-spoked wheels appear on the ground, and sweet-smelling lotuses spring forth. The sentient beings who have been born as animals who come in contact with the feet of the Tathāgata enjoy comfort for seven nights, and when they pass away, they are reborn in the fortunate heavenly realms. Although his robes are not in contact with even four inches of the body of the Tathāgata, the wind named the howler is not able to stir them. The radiance of his body reaches as far as the Incessant Hell, filling the sentient beings there with pleasant sensations. Thus, Śāriputra, the Tathāgata makes no bodily errors.

source: ཡང་ཤཱ་རིའི་བུ་གང་གི་ཕྱིར་ངག་འཁྲུལ་པ་གང་ལས་བྱིས་པའམ། མཁས་པ་ཆོས་དང་འཐུན་པས་རྒོལ་བར་བྱེད་པའི་ངག་གི་འཁྲུལ་པ་དེ་བཞིན་གཤེགས་པ་ལ་མེད་དོ། ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་ནི་དུས་སུ་སྨྲ་བ། ཡང་དག་པར་སྨྲ་བ། བདེན་པར་སྨྲ་བ། ཚིགས་སུ་སྨྲ་བ། ཇི་སྐད་སྨྲ་བ་དེ་བཞིན་དུ་བྱེད་པའོ། ། ཤིན་ཏུ་ངེས་པའི་ཚིག་གོ ། སེམས་ཅན་ཐམས་ཅད་ཚིམ་པར་བྱེད་པའི་ཚིག་གོ ། མི་ཟློས་པའི་ཚིག་གོ ། དོན་དང་ཡི་གེས་ཤིན་ཏུ་བརྒྱན་པའི་ཚིག་གོ ། སྐད་ཅིག་བརྗོད་པས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་བསམ་པ་ཚིམ་པར་བྱེད་པ་སྟེ། དེའི་ཕྱིར་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་ངག་གི་ལས་འཁྲུལ་པ་མེད་ཅེས་བྱའོ། །
en: “Likewise, Śāriputra, the Tathāgata makes no verbal errors, and neither the immature nor the learned can legitimately accuse him of any verbal violation. Why is this? Śāriputra, it is because the Tathāgata speaks when it is timely, he speaks authentically, he speaks truly, he speaks appropriately, and he speaks accurately. What he says is well stated. What he says is pleasing to all sentient beings. What he says is not repetitive. What he says is meaningful and beautiful. When he utters even a single sound, it delights the minds of all sentient beings. It is thus said that the lords, the buddhas, truly make no verbal errors.

source: ཡང་ཤཱ་རིའི་བུ་སེམས་འཁྲུལ་པ་གང་ལས་བྱིས་པའམ། མཁས་པ་ཆོས་དང་འཐུན་པས་རྒོལ་བར་བྱེད་པའི་སེམས་ཀྱི་འཁྲུལ་པ་དེ་བཞིན་གཤེགས་པ་ལ་མེད་དོ། ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལ་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་ནི་མཉམ་པར་གཞག་པའི་དངོས་པོ་མི་འདོར་ཞིང་སངས་རྒྱས་ཀྱི་བྱ་བ་ཐམས་ཅད་བྱེད་ཀྱང་སེམས་དེར་མི་གཏོང་ཞིང་ཆོས་ཐམས་ཅད་ལ་དེའི་ཆགས་པ་མེད་པའི་ཡེ་ཤེས་མཐོང་བ་འཇུག་སྟེ དེའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་ལ་སེམས་འཁྲུལ་པ་མེད་ཅེས་བྱའོ། ། ཇི་ལྟར་དེའི་སེམས་འཁྲུལ་པ་མེད་པ་དེ་ལྟར་སེམས་ཅན་རྣམས་ཀྱི་སེམས་འཁྲུལ་པ་སྤང་བའི་ཕྱིར་ཆོས་སྟོན་ཏེ་འདི་ནི་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་དང་པོའོ། །
en: “Likewise, Śāriputra, the Tathāgata makes no mental errors, and neither the immature nor the learned can legitimately accuse him of any mental violation. Why is this? Śāriputra, the Tathāgata does not lose his focus. He performs all the activities of awakening without abandoning his commitment, and he does so with the unimpeded vision of knowledge. Thus the Tathāgata makes no mental errors, and he therefore teaches the Dharma so that sentient beings, too, may overcome their mental errors. This is the first of his unique buddha qualities.

source: གཞན་ཡང་ཤཱ་རིའི་བུ་ཅ་ཅོ་གང་ལས་བདུད་དམ། བདུད་ཀྱི་རིས་ཀྱི་ལྷའི་བུ་འམ། གཞན་མུ་སྟེགས་ཅན་གྱིས་གླགས་རྙེད་པར་འགྱུར་བའི་ཅ་ཅོ་དེ་བཞིན་གཤེགས་པ་ལ་མེད་དོ། །ཡང་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་ལ་ཅ་ཅོ་འམ། རྗེས་སུ་ཅ་ཅོ་འབྱིན་པ་མེད་དེ། དེ་བཞིན་གཤེགས་པ་ནི་རྗེས་སུ་ཆགས་པ་དང་། ཁོང་ཁྲོ་བ་དང་བྲལ་བ་སྟེ། དེ་སེམས་ཅན་ཐམས་ཅད་ཀྱིས་བཀུར་སྟི་བྱས་ཀྱང་མཐོས་པར་མི་སེམས། སེམས་ཅན་ཐམས་ཅད་ཀྱིས་བཀུར་སྟི་མ་བྱས་ཀྱང་འཁྲུག་པ་མེད་དོ། ། དེ་གང་ལས་འགྱོད་པའམ། རྗེས་སུ་ཅ་ཅོ་འབྱིན་པར་འགྱུར་བའི་བྱ་བ་མཆོག་གམ། མཐར་ཕྱིན་པ་ཅི་ཡང་དེ་བཞིན་གཤེགས་པ་ལ་མེད་དེ། དེ་བཞིན་གཤེགས་པ་ནི་འཇིག་རྟེན་དང་མི་རྩོད་པས་དེའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་ལ་ཅ་ཅོ་མེད་དོ། ། དེ་བཞིན་གཤེགས་པ་ནི་ཉོན་མོངས་པ་མེད་པར་གནས་པ་སྟེ། ངའི་བ་མེད། འཛིན་པ་མེད། ལེན་པ་མེད། མདུད་པ་ཐམས་ཅད་དང་བྲལ་བ་སྟེ། དེའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་ལ་ཅ་ཅོ་མེད་དོ། ། ཇི་ལྟར་དེ་ལ་ཅ་ཅོ་མེད་པ་དེ་ལྟར་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཅ་ཅོ་ཐམས་ཅད་སྤང་བའི་ཕྱིར་ཆོས་སྟོན་ཏེ་འདི་ནི་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་གཉིས་པའོ། །
en: “Moreover, Śāriputra, the Tathāgata never makes any ill-considered noise that Māra and his retinue, the gods, or non-Buddhists might use against him. Śāriputra, the Tathāgata is neither noisy nor loud in response to anything. The Tathāgata is truly without addictions or anger, and he is not encouraged if sentient beings praise him, nor does he become agitated if sentient beings criticize him. The Tathāgata does not express regret or sorrow when any of his activities do not bring excellent results or achieve their intended aim. The Tathāgata does not quarrel with the world, and therefore the Tathāgata never makes any ill-considered noise. The Tathāgata is unaffected by strife, and he is without egotism, without attachment, without clinging, and free from all knots. These are the reasons the Tathāgata never makes any noise. And just as he does not make any ill-considered noise, he teaches the Dharma so that sentient beings, too, may avoid all types of ill-considered noise. This is the second of his unique buddha qualities.

source: གཞན་ཡང་ཤཱ་རིའི་བུ་བསྙེལ་བ་གང་ལས་ཆོས་གང་ལ་ཡང་རྨོངས་པར་འགྱུར་བའི་བསྙེལ་བ་དེ་བཞིན་གཤེགས་པ་ལ་མེད་དེ། བསམ་གཏན་དང་། རྣམ་པར་ཐར་པ་དང་། ཏིང་ངེ་འཛིན་དང་། སྙོམས་པར་འཇུག་པ་ལ་ཐོགས་པ་མེད་ཅིང་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་ཀྱི་སྤྱོད་པ་དང་། གཡོ་བ་ལ་རྣམ་པར་ལྟ་བའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་ལ་རྨོངས་པ་མེད་དོ། ། སོ་སོར་ཅི་རིགས་པར་ཆོས་སྟོན་པའི་ཕྱིར་ཀུན་ཏུ་ཉམས་པ་མེད་དོ། ། འདས་པ་དང་། མ་འོངས་པ་དང་། ད་ལྟར་ལ་ཐོགས་པ་མེད་པའི་ཡེ་ཤེས་མཐོང་བའི་ཕྱིར་དོན་དང་། ཆོས་དང་། ངེས་པའི་ཚིག་དང་། སྤོབས་པ་སོ་སོ་ཡང་དག་པར་རིག་པ་ལ་ཀུན་ཏུ་ཉམས་པ་མེད་དོ། ། ཇི་ལྟར་བདག་ཀུན་ཏུ་ཉམས་པ་མེད་ཅིང་འདས་པ་དང་། མ་འོངས་པ་དང་། ད་ལྟར་ལ་ཐོགས་པ་མེད་པའི་ཡེ་ཤེས་མཐོང་བ་དེ་ལྟར་སེམས་ཅན་ཐམས་ཅད་བརྗེད་ངས་པར་མི་འགྱུར་བར་བྱ་བའི་ཕྱིར་ཆོས་སྟོན་ཏེ། འདི་ནི་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་གསུམ་པའོ། །
en: “Moreover, Śāriputra, the Tathāgata never lacks awareness: he never experiences any confusion with regard to any phenomenon. Because of his liberative meditative states, his attainments of concentration, he is able to see all the mental activities and flickerings of sentient beings without obstruction, and thus he is free from confusion. He is undeluded when it comes to presenting teachings that accord with the merit of a particular individual. Since his knowledge that sees the past, the present, and the future is unobstructed, his command of meaning, objects, etymology, and eloquence is unfaltering. Thus the Tathāgata himself is unfaltering, and his knowledge sees the past, the present, and the future without obstruction. He therefore teaches the Dharma to all sentient beings without any lack of awareness. This is the third of his unique buddha qualities.

source: གཞན་ཡང་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་ལ། མཉམ་པར་མ་བཞག་པའི་སེམས་མི་དམིགས་ཏེ། དེ་བཞིན་གཤེགས་པ་ནི་འཆག་གམ། བཞེངས་སམ། བཞུགས་སམ། མནལ་ཏམ། བཤོས་གསོལ་ལམ། གསུང་ངམ། ཅང་མི་གསུང་བར་གྱུར་ཀྱང་རུང་སྟེ། རྟག་ཏུ་མཉམ་པར་གཞག་ཅིང་ཏིང་ངེ་འཛིན་ཟབ་མོ་དམ་པའི་མཐར་ཕྱིན་པ། སྒྲིབ་པ་མེད་པའི་བསམ་གཏན་ལ་བསམ་གཏན་བྱེད་པ་སྟེ། དེ་བཞིན་གཤེགས་པའི་བྱིན་གྱི་རླབས་མ་གཏོགས་པར་སེམས་ཅན་གྱི་རིས་ན་སེམས་ཅན་གང་མཉམ་པར་བཞག་ཀྱང་རུང་། མཉམ་པར་མ་བཞག་ཀྱང་རུང་སྟེ། སུ་ཡང་དེ་བཞིན་གཤེགས་པའི་སེམས་ལ་ལྟ་བར་ནུས་པ་མེད་དོ། ། ཇི་ལྟར་དེ་བཞིན་གཤེགས་པ་རྟག་ཏུ་མཉམ་པར་གཞག་པ་དེ་ལྟར་ཏིང་ངེ་འཛིན་ལ་ལྟ་བས་སེམས་ཅན་རྣམས་ལ་ཆོས་སྟོན་ཏེ། འདི་ནི་དེ་བཞིན་གཤེགས་པའི་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཞི་པའོ། །
en: “Moreover, Śāriputra, the Tathāgata does not become unfocused in his mind: whether he is walking, standing, sitting, lying down, eating, speaking, or remaining silent, the Tathāgata is constantly focused. He has attained the penultimate profound state of concentration and remains in unobstructed meditation. There is no sentient being in any state of being, whether focused or unfocused, who is able to observe the mind of the Tathāgata, except with the Tathāgata’s blessing. Thus, the Tathāgata remains always focused, and he therefore teaches the Dharma to sentient beings so that they might develop concentration. This is the fourth of his unique buddha qualities.
